org/tic_tac_toe.org
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="https://gongzhitaao.org/orgcss/org.css"/>
#+EXPORT_FILE_NAME: ../html/tic-tac-toe.html
#+OPTIONS: broken-links:t
#+TITLE: Let's play Tic-tac-toe
This chapter uses the game AI code developed in the [[org/game.org][previous chapter]] to play Tic-tac-toe. To play the game, run =tic_tac_toe.play()=. This part is not in Hughes' paper.

#+begin_src python :noweb no-export :tangle ../src/tic_tac_toe.py
  <<TIC_TAC_TOE_IMPORTS>>
  <<TIC_TAC_TOE_RULES>>
  <<TIC_TAC_TOE_TREE>>
  <<TIC_TAC_TOE_STATIC>>
  <<TIC_TAC_TOE_MINIMAX>>
  <<TIC_TAC_TOE_PLAY>>
#+end_src

* The Tic-tac-toe game board
These functions define the Tic-tac-toe game world:
#+begin_src python :tangle no :noweb-ref TIC_TAC_TOE_RULES
  ### gameplay options
  use_player_token = True
  shuffle_moves = False
  max_depth = 5

  posinf = 100000
  neginf = -1 * posinf

  num_pos = 9
  line_idx = [[0, 1, 2], [3, 4, 5], [6, 7, 8], [0, 3, 6], [1, 4, 7], [2, 5, 8], [0, 4, 8], [2, 4, 6]]

  # Cell is a type alias for representing the state of a cell in a board
  Cell = Optional[int]
  # Board is a type alias for representing board configurations
  Board = List[Cell]

  def init_board() -> Board:
      """Creat an empty board.
      An unoccupied position is represented by None"""
      board: List[Optional[int]] = [None for i in range(num_pos)]
      return board

  def board_line(line_idx: List[int], board: Board) -> List[Cell]:
      """Return a line (one of line_idx) of a board"""
      return [board[i] for i in line_idx]

  def board_lines(board: Board) -> List[List[Cell]]:
      """Return all the lines in a board"""
      return list(map(lambda idx: board_line(idx, board), line_idx))

  def won(board: Board, player: int) -> bool:
      """Has player won?"""
      assert player in [0, 1]
      lines = board_lines(board)

      if any(map(lambda l: l.count(player) == 3, lines)):
          return True
      else:
          return False

  def who_plays(board: Board) -> int:
      """Which player is playing the next move?"""
      return board.count(0) - board.count(1)
#+end_src

Note that the player who plays the next move is not stored as a game state, because it can easily be inferred from the game board by =who_plays=.
#+begin_src python :noweb yes :tangle ../src/test_tic_tac_toe.py
  def test_who_plays():
      b = init_board()
      assert who_plays(b) == 0

      b[1] = 0
      assert who_plays(b) == 1
#+end_src

* Legal moves
The function =moves= encapsulates the legal moves of Tic-tac-toe. Given a board configuration, =moves= returns an iterator of board configurations associated with the legal next moves.
#+begin_src python :tangle no :noweb-ref TIC_TAC_TOE_RULES
  def make_move(board: Board, move: int, current_player: int) -> Board:
      """Apply a move (0-8) to a board for a player.
      Return a new board.
      """
      new_board = board.copy()
      assert new_board[move] is None
      assert current_player in [0, 1]

      new_board[move] = current_player

      return new_board

  def moves(board: Board) -> Optional[Iterator[Board]]:
      """Returns an iterator of boards for all legal next moves."""
      next_player = who_plays(board)
      other_player = (next_player + 1) % 2

      if won(board, other_player):
          # There is no legal move if the game is already won
          return None
      else:
          candidate_moves = [i for i in range(num_pos) if board[i] is None]

          if shuffle_moves:
              shuffle(candidate_moves)

          if len(candidate_moves) == 0:
              return None
          else:
              return map(lambda i: make_move(board, i, next_player), candidate_moves)
#+end_src

Simple tests to make sure that =moves= knows it when no legal moves are available.
#+begin_src python :noweb yes :tangle ../src/test_tic_tac_toe.py
  def test_moves():
      # there should be no legal move for 0 because 1 has already won
      b = [1, 0, 0, 1, 0, None, 1, None, None]
      assert moves(b) is None

      # there should be no legal move for 0 because 0 has already won    
      b = [1, 0, 0, 1, 0, None, None, 0, 1]
      assert moves(b) is None

      # A draw. the board is full
      b = [1, 0, 1, 0, 0, 1, 0, 1, 0]
      assert moves(b) is None
#+end_src

* The Tic-tac-toe game tree
In the previous chapter, we defined generic =gametree= and =prune=. Here, we customize them for Tic-tac-toe:
#+begin_src python :tangle no :noweb-ref TIC_TAC_TOE_TREE
  gametree: Callable[[Board], Node] = game.gametree(moves)

  def prune(tree: Node) -> Node:
      return lazy_utils.prune(max_depth, tree)
#+end_src

With these, we can generate all possible Tic-tac-toe games! Let's find out how big the tree is.
#+begin_src python :exports both :noweb no-export :results output :dir ../src/
  <<DEMO_IMPORTS>>

  d = tree_depth(gametree(init_board()))
  print("depth=", d)
  n = tree_size(gametree(init_board()))
  print("number of nodes=", n)
#+end_src

#+RESULTS:
: depth= 10
: number of nodes= 549946

For playing Tic-tac-toe, we set a limit to the depth of the game tree to =max_depth=, which is set to 5. Let's check the size of the pruned tree:
#+begin_src python :noweb yes :tangle ../src/test_tic_tac_toe.py
  def test_prune():
      print("\n\n## test_prune: after pruning")
      b0 = init_board()
      t = prune(gametree(b0))
      d = tree_depth(t)
      print("depth=", d)
#+end_src

#+begin_src python :noweb yes :tangle ../src/test_tic_tac_toe.py
  def test_prune2():
      b0 = init_board()
      t = prune(gametree(b0))
      s = tree_size(t)
      print("size=", s)
#+end_src

The winning conditions have to be reflected in the game tree. Let's make sure that they are:
#+begin_src python :noweb yes :tangle ../src/test_tic_tac_toe.py
  def test_game_tree_structure():
      # Since player 0 has won, there should be no subtrees
      b = [1, 0, 0, 1, 0, None, None, 0, 1]
      assert won(b, 0) == True
      t = gametree(b)
      assert t[1] is None

      # Since player 1 has won, there should be no subtrees
      b = [1, 0, 0, 1, 0, None, 1, None, None]
      assert won(b, 1) == True
      t = gametree(b)
      assert t[1] is None

      # This is a draw. There should be no subtrees
      b = [1, 0, 1, 0, 0, 1, 0, 1, 0]
      assert won(b, 0) == False
      assert won(b, 1) == False
      t = gametree(b)
      assert t[1] is None
#+end_src

