html/tic-tac-toe.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2022-03-26 Sat 22:30 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Let's play Tic-tac-toe</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Hsin-Hao Yu" />
<link rel="stylesheet" type="text/css" href="https://gongzhitaao.org/orgcss/org.css"/>
</head>
<body>
<div id="content">
<h1 class="title">Let's play Tic-tac-toe</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org7c26080">1. The Tic-tac-toe game board</a></li>
<li><a href="#org3dd2628">2. Legal moves</a></li>
<li><a href="#org8e77114">3. The Tic-tac-toe game tree</a></li>
<li><a href="#org6ffc4bb">4. Static evaluation</a></li>
<li><a href="#orgf13fac0">5. Score the game tree</a></li>
<li><a href="#org8bfafb7">6. Minimax</a></li>
<li><a href="#org9b0a284">7. Gameplay</a></li>
<li><a href="#org0125d7d">8. Imports</a></li>
</ul>
</div>
</div>
<p>
This chapter uses the game AI code developed in the to play Tic-tac-toe. To play the game, run <code>tic_tac_toe.play()</code>. This part is not in Hughes' paper.
</p>

<div class="org-src-container">
<pre class="src src-python">&lt;&lt;TIC_TAC_TOE_IMPORTS&gt;&gt;
&lt;&lt;TIC_TAC_TOE_RULES&gt;&gt;
&lt;&lt;TIC_TAC_TOE_TREE&gt;&gt;
&lt;&lt;TIC_TAC_TOE_STATIC&gt;&gt;
&lt;&lt;TIC_TAC_TOE_MINIMAX&gt;&gt;
&lt;&lt;TIC_TAC_TOE_PLAY&gt;&gt;
</pre>
</div>

<div id="outline-container-org7c26080" class="outline-2">
<h2 id="org7c26080"><span class="section-number-2">1</span> The Tic-tac-toe game board</h2>
<div class="outline-text-2" id="text-1">
<p>
These functions define the Tic-tac-toe game world:
</p>
<div class="org-src-container">
<pre class="src src-python">### gameplay options
use_player_token = True
shuffle_moves = False
max_depth = 5

posinf = 100000
neginf = -1 * posinf

num_pos = 9
line_idx = [[0, 1, 2], [3, 4, 5], [6, 7, 8], [0, 3, 6], [1, 4, 7], [2, 5, 8], [0, 4, 8], [2, 4, 6]]

# Cell is a type alias for representing the state of a cell in a board
Cell = Optional[int]
# Board is a type alias for representing board configurations
Board = List[Cell]

def init_board() -&gt; Board:
    """Creat an empty board.
    An unoccupied position is represented by None"""
    board: List[Optional[int]] = [None for i in range(num_pos)]
    return board

def board_line(line_idx: List[int], board: Board) -&gt; List[Cell]:
    """Return a line (one of line_idx) of a board"""
    return [board[i] for i in line_idx]

def board_lines(board: Board) -&gt; List[List[Cell]]:
    """Return all the lines in a board"""
    return list(map(lambda idx: board_line(idx, board), line_idx))

def won(board: Board, player: int) -&gt; bool:
    """Has player won?"""
    assert player in [0, 1]
    lines = board_lines(board)

    if any(map(lambda l: l.count(player) == 3, lines)):
	return True
    else:
	return False

def who_plays(board: Board) -&gt; int:
    """Which player is playing the next move?"""
    return board.count(0) - board.count(1)
</pre>
</div>

<p>
Note that the player who plays the next move is not stored as a game state, because it can easily be inferred from the game board by <code>who_plays</code>.
</p>
<div class="org-src-container">
<pre class="src src-python">def test_who_plays():
    b = init_board()
    assert who_plays(b) == 0

    b[1] = 0
    assert who_plays(b) == 1
</pre>
</div>
</div>
</div>

<div id="outline-container-org3dd2628" class="outline-2">
<h2 id="org3dd2628"><span class="section-number-2">2</span> Legal moves</h2>
<div class="outline-text-2" id="text-2">
<p>
The function <code>moves</code> encapsulates the legal moves of Tic-tac-toe. Given a board configuration, <code>moves</code> returns an iterator of board configurations associated with the legal next moves.
</p>
<div class="org-src-container">
<pre class="src src-python">def make_move(board: Board, move: int, current_player: int) -&gt; Board:
    """Apply a move (0-8) to a board for a player.
    Return a new board.
    """
    new_board = board.copy()
    assert new_board[move] is None
    assert current_player in [0, 1]

    new_board[move] = current_player

    return new_board

def moves(board: Board) -&gt; Optional[Iterator[Board]]:
    """Returns an iterator of boards for all legal next moves."""
    next_player = who_plays(board)
    other_player = (next_player + 1) % 2

    if won(board, other_player):
	# There is no legal move if the game is already won
	return None
    else:
	candidate_moves = [i for i in range(num_pos) if board[i] is None]

	if shuffle_moves:
	    shuffle(candidate_moves)

	if len(candidate_moves) == 0:
	    return None
	else:
	    return map(lambda i: make_move(board, i, next_player), candidate_moves)
</pre>
</div>

<p>
Simple tests to make sure that <code>moves</code> knows it when no legal moves are available.
</p>
<div class="org-src-container">
<pre class="src src-python">def test_moves():
    # there should be no legal move for 0 because 1 has already won
    b = [1, 0, 0, 1, 0, None, 1, None, None]
    assert moves(b) is None

    # there should be no legal move for 0 because 0 has already won    
    b = [1, 0, 0, 1, 0, None, None, 0, 1]
    assert moves(b) is None

    # A draw. the board is full
    b = [1, 0, 1, 0, 0, 1, 0, 1, 0]
    assert moves(b) is None
</pre>
</div>
</div>
</div>

<div id="outline-container-org8e77114" class="outline-2">
<h2 id="org8e77114"><span class="section-number-2">3</span> The Tic-tac-toe game tree</h2>
<div class="outline-text-2" id="text-3">
<p>
In the previous chapter, we defined generic <code>gametree</code> and <code>prune</code>. Here, we customize them for Tic-tac-toe:
</p>
<div class="org-src-container">
<pre class="src src-python">gametree: Callable[[Board], Node] = game.gametree(moves)

def prune(tree: Node) -&gt; Node:
    return lazy_utils.prune(max_depth, tree)
</pre>
</div>

<p>
With these, we can generate all possible Tic-tac-toe games! Let's find out how big the tree is.
</p>
<div class="org-src-container">
<pre class="src src-python">&lt;&lt;DEMO_IMPORTS&gt;&gt;

d = tree_depth(gametree(init_board()))
print("depth=", d)
n = tree_size(gametree(init_board()))
print("# nodes=", n)
</pre>
</div>

<p>
For playing Tic-tac-toe, we set a limit to the depth of the game tree to <code>max_depth</code>, which is set to 5. Let's check the size of the pruned tree:
</p>
<div class="org-src-container">
<pre class="src src-python">def test_prune():
    print("\n\n## test_prune: after pruning")
    b0 = init_board()
    t = prune(gametree(b0))
    d = tree_depth(t)
    print("depth=", d)
</pre>
</div>

<div class="org-src-container">
<pre class="src src-python">def test_prune2():
    b0 = init_board()
    t = prune(gametree(b0))
    s = tree_size(t)
    print("size=", s)
</pre>
</div>

<p>
The winning conditions have to be reflected in the game tree. Let's make sure that they are:
</p>
<div class="org-src-container">
<pre class="src src-python">def test_game_tree_structure():
    # Since player 0 has won, there should be no subtrees
    b = [1, 0, 0, 1, 0, None, None, 0, 1]
    assert won(b, 0) == True
    t = gametree(b)
    assert t[1] is None

    # Since player 1 has won, there should be no subtrees
    b = [1, 0, 0, 1, 0, None, 1, None, None]
    assert won(b, 1) == True
    t = gametree(b)
    assert t[1] is None

    # This is a draw. There should be no subtrees
    b = [1, 0, 1, 0, 0, 1, 0, 1, 0]
    assert won(b, 0) == False
    assert won(b, 1) == False
    t = gametree(b)
    assert t[1] is None
</pre>
</div>
</div>
</div>
