html/tic-tac-toe.html

<div id="outline-container-org6ffc4bb" class="outline-2">
<h2 id="org6ffc4bb"><span class="section-number-2">4</span> Static evaluation</h2>
<div class="outline-text-2" id="text-4">
<p>
A static evaluation function takes a board configuration and returns a number representing how good the position is (without taking future moves into account). There are different ways to evaluate how good a Tic-tac-toe configuration is. I implemented a common one in  <code>static_eval(player)</code>. For a given <code>player</code>, the function evaluates if the configuration "looks good". A positive number means that the configuration is good for <code>player</code>. A negative number means that it's good for the other player.
</p>
<div class="org-src-container">
<pre class="src src-python">### Heuristic evaluation of board configurations
def is_good_line(n: int, player: int, line: List[Cell]) -&gt; bool:
    """A typical way to evaluate if a line is good"""

    assert n in [1, 2]
    assert player in [0, 1]

    v1 = line.count(player) == n
    v2 = line.count(None) == 3 - n
    return v1 and v2

def count_good_lines(n: int , player: int, lines: List[List[Cell]]) -&gt; int:
    """How many good lines?"""

    assert n in [1, 2]
    assert player in [0, 1]

    zz = list(map(lambda l: is_good_line(n, player, l), lines))
    return zz.count(True)

def static_eval_0(board: Board) -&gt; int:
    """Static board value for player 0
    &gt;0: player 0 is doing better
    &lt;0: player 1 is doing better
    """
    lines = board_lines(board)

    if any(map(lambda l: l.count(0) == 3, lines)):
	val = posinf
    elif any(map(lambda l: l.count(1) ==3, lines)):
	val = neginf
    else:
	x2 = count_good_lines(2, 0, lines)
	x1 = count_good_lines(1, 0, lines)

	o2 = count_good_lines(2, 1, lines)
	o1 = count_good_lines(1, 1, lines)

	val = 3 * x2 + x1 - (3 * o2 + o1)
    return val

def static_eval(i: int) -&gt; Callable[[Board], int]:
    """Static board value for player i"""
    assert i in [0, 1]

    def static_eval_(board):
	v = static_eval_0(board)
	if i == 0:
	    return v
	else:
	    return -1 * v

    return static_eval_
</pre>
</div>

<p>
It's important that the static evaluation function knows when a player wins the game:
</p>
<div class="org-src-container">
<pre class="src src-python">def test_static_eval_winning_condition():
    # evaluate for player 0
    eval_0 = static_eval(0)
    # evaluate for player 1
    eval_1 = static_eval(1)

    # player 0 won
    b = [1, 0, 0, 1, 0, None, None, 0, 1]
    assert eval_0(b) == posinf
    assert eval_1(b) == neginf

    # player 1 won
    b = [1, 0, 0, 1, 0, None, 1, None, None]
    assert eval_0(b) == neginf
    assert eval_1(b) == posinf
</pre>
</div>
</div>
</div>

<div id="outline-container-orgf13fac0" class="outline-2">
<h2 id="orgf13fac0"><span class="section-number-2">5</span> Score the game tree</h2>
<div class="outline-text-2" id="text-5">
<p>
Using the <code>maptree</code> function defined in a to apply the static evaluation function to every node in the game tree, we can score an entire game!
</p>

<p>
Instead of replacing each label in the game tree with a score, I want to keep the board configuration as well. So let's define a new version of <code>static_eval</code> that returns a state object. The <code>State</code> class defined below implements methods for numerical comparisons, so the Minimax-related functions defined in the previous chapter can treat a State as if it were an integer.
</p>
<div class="org-src-container">
<pre class="src src-python">@dataclass
class State:
    board: Board
    score: int

    def __eq__(self, other):
	return self.score == other.score
    def __gt__(self, other):
	return self.score &gt; other.score
    def __ge__(self, othre):
	return self.score &gt;= other.score
    def __lt__(self, other):
	return self.score &lt; other.score
    def __le__(self, other):
	return self.score &lt;= other.score
</pre>
</div>

<p>
This is the static evaluation function that returns a State:
</p>
<div class="org-src-container">
<pre class="src src-python">def static_eval_state(i: int) -&gt; Callable[[Board], State]:
    """Static board state for player i"""
    assert i in [0, 1]
    score_func = static_eval(i)

    def static_eval_(board):
	return State(board, score_func(board))

    return static_eval_
</pre>
</div>

<p>
The following shows the distribution of the scores in a pruned tree:
</p>
<div class="org-src-container">
<pre class="src src-python">def test_static_eval():
    """Apply static eval to a game tree"""
    print("\n## test_static_eval2")
    def freq(lst):
	dict = {}
	for i in lst:
	    if i in dict:
		dict[i] = dict[i] + 1
	    else:
		dict[i] = 1
	return dict

    def show_freq(dict):
	k = dict.keys()
	k = sorted(k)
	for kk in k:
	    print(f'{kk:10}     {dict[kk]}')

    b0 = init_board()
    t = prune(gametree(b0))
    t = maptree(static_eval_state(0), t)
    t = tree_labels(t) # collect all the states from the tree
    t = list(map(lambda s: s.score, t)) # extract just the scores 
    show_freq(freq(t))
</pre>
</div>

<p>
The static evaluation function, when applied to the game tree, should reflect winning conditions.
</p>
<div class="org-src-container">
<pre class="src src-python">def test_gametree_evaluation():
    # player 0 has won
    b = [1, 0, 0, 1, 0, None, None, 0, 1]
    (score, subtrees) = maptree(static_eval(0), prune(gametree(b)))
    assert subtrees is None and score == posinf

    # player 1 has won
    b = [1, 0, 0, 1, 0, None, 1, None, None]
    (score, subtrees) = maptree(static_eval(0), prune(gametree(b)))
    assert subtrees is None and score == neginf

    # This is a draw
    b = [1, 0, 1, 0, 0, 1, 0, 1, 0]
    (score, subtrees) = maptree(static_eval(0), prune(gametree(b)))
    assert subtrees is None and score == 0
</pre>
</div>
</div>
</div>

<div id="outline-container-org8bfafb7" class="outline-2">
<h2 id="org8bfafb7"><span class="section-number-2">6</span> Minimax</h2>
<div class="outline-text-2" id="text-6">
<p>
Here's the first move evaluation function, based on just Minimax:
</p>
<div class="org-src-container">
<pre class="src src-python"># given a player, returns a tree evlauation function
def evaluate1(player: int) -&gt; Callable[[Board], State]:
    """Evaluate tic-tac-toe tree for player i (version 1)"""
    return game.evaluate1(gametree, static_eval_state(player), prune)
</pre>
</div>

<p>
Let's try it on the most basic conditions:
</p>
<div class="org-src-container">
<pre class="src src-python">def test_tree_eval():
    print("## test_tree_eval()")
    b = [1, 0, 0, None, 0, None, 1, None, None]
    print("\nGiven this board, player 1 (O) to play")
    player = 1
    display_board(b)

    best_move = evaluate1(player)(b)
    print()
    print("O's best move:")
    display_board(best_move.board)

    # player 1 should be able to win the game in one move
    # so the score should be the winning score
    assert best_move.score == posinf

#@pytest.mark.skip(reason="skip skip skip")    
</pre>
</div>
</div>
</div>
