org/tic_tac_toe.org
* Gameplay
Simple utilities for displaying the game board and for handling human player moves:
#+begin_src python :tangle no :noweb-ref TIC_TAC_TOE_PLAY
  def player_token(i: int) -> str:
      assert i in [0, 1]
      if use_player_token:
          return "X" if i == 0 else "O"
      else:
          return "0" if i== 0 else "1"

  def display_board(board: Board, coordinates = False) -> None:
      """Display a board"""
      def row(lst):
          return reduce(lambda a, b: a + " "+ b, lst, "")

      d = {None: '.', 1: player_token(1), 0: player_token(0)}

      zz = list(map(lambda i: d[i], board))
      zz = [zz[i:i+3] for i in range(0, 9, 3)]
      zz = list(map(row, zz))

      if coordinates:
          def d_(i):
              if board[i] is None:
                  return str(i)
              else:
                  return "."
          zz2 = [d_(i) for i in range(9)]
          zz2 = [zz2[i:i+3] for i in range(0, 9, 3)]
          zz2 = list(map(row, zz2))

      res = ""
      if coordinates:
          for i in range(3):
              res = res + zz[i] + "\t\t" + zz2[i] + "\n"
      else:
          for i in range(3):
              res = res + zz[i] + "\n"

      print(res[:-1])

  def human_next_move(board: Board) -> Optional[Board]:
      """Display current board, ask player to make the next move.
      Return a board after the player's move.
      """
      display_board(board, coordinates = True)
      legal_moves = [i for i in range(num_pos) if board[i] is None]
      if legal_moves == []:
          return None
      else:
          player = who_plays(board)

          ok = False
          while not ok:
              m = input(f"player {player_token(player)} move?")
              try:
                  i = int(m)
                  if i in legal_moves:
                      ok = True
              except ValueError:
                  pass

          return make_move(board, i, player) 
#+end_src

This let a player make a move. A player can be human or computer.
#+begin_src python :tangle no :noweb-ref TIC_TAC_TOE_PLAY
  def computer_next_move(board: Board, eval_func: Callable[[int],Callable[[Board], State]]) -> Optional[Board]:
      player = who_plays(board)
      computer_move_function = eval_func(player)
      # computer_move_function is a State
      return computer_move_function(board).board

  def player_next_move(board: Board, player_settings = {0: 'human', 1: 'computer'}, eval_func = evaluate1) -> Optional[Board]:
      player = who_plays(board)
      if player_settings[player] == 'human':
          return human_next_move(board)
      else:
          return computer_next_move(board, eval_func)
#+end_src

The main game loop:
#+begin_src python :tangle no :noweb-ref TIC_TAC_TOE_PLAY
  def play(player_settings = {0: 'human', 1: 'computer'}, eval_func = evaluate1) -> None:
      b = init_board()

      finished = False
      while not finished:
          b = player_next_move(b, player_settings, eval_func)
          player = (who_plays(b) + 1) % 2
          print()
          print(f"{player_token(player)} played:")
          display_board(b)
          print()

          assert b is not None
          if won(b, player):
              print(f"{player_token(player)} won!")
              finished = True
          elif len([i for i in range(num_pos) if b[i] is None]) == 0:
              print("Draw!")
              finished = True  
#+end_src
* Imports
#+begin_src python :tangle no :noweb-ref TIC_TAC_TOE_IMPORTS
  from typing import List, Iterator, Callable, Optional
  from functools import reduce
  from random import shuffle
  from dataclasses import dataclass 

  from lazy_utils import Node
  import lazy_utils
  import game
#+end_src

#+begin_src python :tangle no :noweb-ref TEST_TIC_TAC_TOE_IMPORTS
  from tic_tac_toe import init_board, moves, static_eval, display_board
  from tic_tac_toe import who_plays, posinf, neginf, gametree, prune, evaluate1, won
  from tic_tac_toe import static_eval_state
  from lazy_utils import tree_size, tree_depth, maptree, tree_labels
  import pytest
#+end_src

#+begin_src python :tangoe no :noweb-ref DEMO_IMPORTS
  from tic_tac_toe import init_board, gametree, prune
  from lazy_utils import tree_size, tree_depth
#+end_src
